app/controllers/posts_controller.rb

       def create
        #render plain: params[:post].inspect
        @post=Post.new(post_params)

        @post.save
---
INSERT INTO "posts" ("name", "email", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"